
# State **`s3://infrahouse-github-control-state/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |    Destroy |
|:---------:|--------:|-----------:|-----------:|
|     ✅     |       3 |          1 |          0 |
## Affected resources by action

|  Action  | Resources                                                                  |
|:--------:|:---------------------------------------------------------------------------|
|    🟢     | `module.repos["test"].github_actions_secret.secret["GH_TOKEN"]`            |
|    🟢     | `module.repos["test"].github_repository.repo`                              |
|    🟢     | `module.repos["test"].github_team_repository.dev`                          |
|    🟢     | `module.infrahouse8-github-control.module.state-bucket.random_pet.suffix:` |
|    🟡     | `module.infrahouse8-github-control.module.gha-admin.aws_iam_policy.github` |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/498d00c5-5dff-4fe1-bce3-5da4ae2ad95c/terraform-bin plan -var-file=configuration.tfvars -no-color --out=tf.plan
module.infrahouse8-github-control.module.state-bucket.random_pet.suffix: Refreshing state... [id=infrahouse-github-control-state-polished-lioness]
data.external.env: Reading...
data.external.env: Read complete after 0s [id=-]
module.ih_8_repos["github-control"].github_repository.repo: Refreshing state... [id=github-control]
module.ih8_tf_template.github_repository.repo: Refreshing state... [id=terraform-template]
module.ih_tf_template.github_repository.repo: Refreshing state... [id=terraform-template]
github_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]
github_team.dev: Refreshing state... [id=7332815]
github_organization_settings.infrahouse: Refreshing state... [id=121984263]
module.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy.admin: Reading...
data.aws_secretsmanager_secrets.gh_secrets: Reading...
data.aws_ssm_parameter.gh_secrets_namespace: Reading...
module.infrahouse8-github-control.module.gha-admin.data.aws_iam_openid_connect_provider.github: Reading...
module.ih_8_repos["github-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=github-control:akuzminsky]
module.ih_8_repos["github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=github-control:GH_TOKEN]
module.infrahouse8-github-control.module.state-bucket.aws_dynamodb_table.terraform_locks: Refreshing state... [id=infrahouse-github-control-state-polished-lioness]
module.ih_8_repos["github-control"].github_branch_default.main: Refreshing state... [id=github-control]
data.aws_secretsmanager_secrets.gh_secrets: Read complete after 0s [id=us-west-1]
data.aws_ssm_parameter.gh_secrets_namespace: Read complete after 0s [id=gh_secrets_namespace]
aws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__PYPI_API_TOKEN-5N8UtG]
aws_secretsmanager_secret.codacy_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__CODACY_PROJECT_TOKEN-fhlOS2]
module.infrahouse8-github-control.module.gha-admin.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]
module.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.github-trust: Reading...
module.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.github-trust: Read complete after 0s [id=2229426295]
module.infrahouse8-github-control.module.gha-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-github-control-github]
module.ih_tf_template.github_team_repository.dev[0]: Refreshing state... [id=7332815:terraform-template]
github_team_members.dev: Refreshing state... [id=7332815]
data.aws_secretsmanager_secret_version.codacy_api_token: Reading...
data.aws_secretsmanager_secret_version.pypi_api_token: Reading...
data.aws_secretsmanager_secret_version.codacy_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__CODACY_PROJECT_TOKEN-fhlOS2|AWSCURRENT]
data.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 1s [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__PYPI_API_TOKEN-5N8UtG|AWSCURRENT]
module.repos["terraform-aws-website-pod"].github_repository.repo: Refreshing state... [id=terraform-aws-website-pod]
module.repos["puppet-code"].github_repository.repo: Refreshing state... [id=puppet-code]
module.repos["aws-control"].github_repository.repo: Refreshing state... [id=aws-control]
module.repos["terraform-aws-service-network"].github_repository.repo: Refreshing state... [id=terraform-aws-service-network]
module.repos["aws-control-289256138624"].github_repository.repo: Refreshing state... [id=aws-control-289256138624]
module.repos["terraform-aws-gh-identity-provider"].github_repository.repo: Refreshing state... [id=terraform-aws-gh-identity-provider]
module.repos["aws-control-493370826424"].github_repository.repo: Refreshing state... [id=aws-control-493370826424]
module.repos["aws-control-303467602807"].github_repository.repo: Refreshing state... [id=aws-control-303467602807]
module.repos["infrahouse-com"].github_repository.repo: Refreshing state... [id=infrahouse-com]
module.repos["terraform-aws-cloud-init"].github_repository.repo: Refreshing state... [id=terraform-aws-cloud-init]
module.repos["terraform-aws-gha-admin"].github_repository.repo: Refreshing state... [id=terraform-aws-gha-admin]
module.repos["terraform-aws-state-manager"].github_repository.repo: Refreshing state... [id=terraform-aws-state-manager]
module.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]
module.repos["proxysql-sandbox"].github_repository.repo: Refreshing state... [id=proxysql-sandbox]
module.repos["terraform-aws-instance-profile"].github_repository.repo: Refreshing state... [id=terraform-aws-instance-profile]
module.repos["terraform-aws-state-bucket"].github_repository.repo: Refreshing state... [id=terraform-aws-state-bucket]
module.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy.admin: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.repos["infrahouse-website-infra"].github_repository.repo: Refreshing state... [id=infrahouse-website-infra]
module.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]
module.repos["terraform-aws-debian-repo"].github_repository.repo: Refreshing state... [id=terraform-aws-debian-repo]
module.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.admin-trust: Reading...
module.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.admin-trust: Read complete after 0s [id=91398067]
module.ih_8_repos["github-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOI2vu7M4CAici]
module.infrahouse8-github-control.module.state-bucket.aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-github-control-state]
module.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.assume: Reading...
module.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=262017685]
module.infrahouse8-github-control.module.gha-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-github-control-admin]
module.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-github-control-state-manager]
module.infrahouse8-github-control.module.gha-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-github-control-admin-20231016152934892800000002]
module.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.github-permissions: Reading...
module.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=2246898652]
module.infrahouse8-github-control.module.gha-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::303467602807:policy/ih-tf-github-control-github20231016152934873800000001]
module.infrahouse8-github-control.module.gha-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-github-control-github-20231016152935026000000003]
module.infrahouse8-github-control.module.state-bucket.aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-github-control-state]
module.infrahouse8-github-control.module.state-bucket.aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-github-control-state]
module.infrahouse8-github-control.module.state-bucket.aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-github-control-state]
module.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_rw: Reading...
module.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_ro: Reading...
module.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=3098380055]
module.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=19153250]
module.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_policy.permissions_rw: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-github-control-state-manager-rw20231016152936864600000002]
module.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_policy.permissions_ro: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-github-control-state-manager-ro20231016152936860000000001]
module.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]: Refreshing state... [id=ih-tf-github-control-state-manager-20231016152937028600000004]
module.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_role_policy_attachment.state-manager-ro: Refreshing state... [id=ih-tf-github-control-state-manager-20231016152936987100000003]
module.repos["terraform-aws-instance-profile"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-instance-profile]
module.repos["terraform-aws-gha-admin"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-gha-admin]
module.repos["terraform-aws-debian-repo"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-debian-repo]
module.repos["terraform-aws-gh-identity-provider"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-gh-identity-provider]
module.repos["terraform-aws-cloud-init"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-cloud-init]
module.repos["terraform-aws-service-network"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-service-network]
module.repos["terraform-aws-state-bucket"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-state-bucket]
module.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]
module.repos["infrahouse-com"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-com]
module.repos["aws-control-493370826424"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-493370826424]
module.repos["aws-control-303467602807"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-303467602807]
module.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]
module.repos["terraform-aws-state-manager"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-state-manager]
module.repos["terraform-aws-website-pod"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-website-pod]
module.repos["infrahouse-website-infra"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-website-infra]
module.repos["proxysql-sandbox"].github_team_repository.dev: Refreshing state... [id=7332815:proxysql-sandbox]
module.repos["aws-control-289256138624"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-289256138624]
module.repos["puppet-code"].github_team_repository.dev: Refreshing state... [id=7332815:puppet-code]
module.repos["aws-control"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control]
module.repos["terraform-aws-state-manager"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-state-manager:GH_TOKEN]
module.repos["terraform-aws-service-network"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-service-network:GH_TOKEN]
module.repos["terraform-aws-website-pod"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-website-pod:GH_TOKEN]
module.repos["aws-control-493370826424"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-493370826424:AWS_DEFAULT_REGION]
module.repos["puppet-code"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=puppet-code:GH_TOKEN]
module.repos["aws-control-289256138624"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-289256138624:GH_TOKEN]
module.repos["terraform-aws-state-bucket"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-state-bucket:GH_TOKEN]
module.repos["aws-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control:GH_TOKEN]
module.repos["infrahouse-toolkit"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:GH_TOKEN]
module.repos["proxysql-sandbox"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=proxysql-sandbox:GH_TOKEN]
module.repos["terraform-aws-debian-repo"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-debian-repo:GH_TOKEN]
module.repos["puppet-code"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=puppet-code:AWS_DEFAULT_REGION]
module.repos["aws-control"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control:AWS_DEFAULT_REGION]
module.repos["terraform-aws-gha-admin"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-gha-admin:GH_TOKEN]
module.repos["infrahouse-toolkit"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-toolkit:AWS_DEFAULT_REGION]
module.repos["terraform-aws-cloud-init"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-cloud-init:GH_TOKEN]
module.repos["aws-control-303467602807"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-303467602807:GH_TOKEN]
module.repos["terraform-aws-instance-profile"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-instance-profile:GH_TOKEN]
module.repos["aws-control-493370826424"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-493370826424:GH_TOKEN]
module.repos["infrahouse-com"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-com:GH_TOKEN]
module.repos["infrahouse-com"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-com:AWS_DEFAULT_REGION]
module.repos["infrahouse-toolkit"].github_actions_secret.secret["CODACY_PROJECT_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:CODACY_PROJECT_TOKEN]
module.repos["terraform-aws-gh-identity-provider"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-gh-identity-provider:GH_TOKEN]
module.repos["cookiecutter-github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=cookiecutter-github-control:GH_TOKEN]
module.repos["infrahouse-website-infra"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-website-infra:AWS_DEFAULT_REGION]
module.repos["infrahouse-toolkit"].github_actions_secret.secret["PYPI_API_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]
module.repos["aws-control-303467602807"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-303467602807:AWS_DEFAULT_REGION]
module.repos["infrahouse-website-infra"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-website-infra:GH_TOKEN]
module.repos["aws-control-289256138624"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-289256138624:AWS_DEFAULT_REGION]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.repos["test"].github_actions_secret.secret["GH_TOKEN"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "test"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # module.repos["test"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Module that creates an S3 bucket for a Terraform state."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "test"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
    }

  # module.repos["test"].github_team_repository.dev will be created
  + resource "github_team_repository" "dev" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "test"
      + team_id    = "7332815"
    }

  # module.infrahouse8-github-control.module.gha-admin.aws_iam_policy.github will be updated in-place
  ~ resource "aws_iam_policy" "github" {
        id          = "arn:aws:iam::303467602807:policy/ih-tf-github-control-github20231016152934873800000001"
        name        = "ih-tf-github-control-github20231016152934873800000001"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = "*" -> [
                          + "arn:aws:iam::303467602807:role/ih-tf-github-control-admin",
                          + "arn:aws:iam::289256138624:role/ih-tf-terraform-control",
                          + "arn:aws:iam::289256138624:role/ih-tf-github-control-state-manager",
                        ]
                      - Sid      = "VisualEditor0"
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags        = {}
        # (5 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: module.infrahouse8-github-control.module.state-bucket.random_pet.suffix: Refreshing state... [id=infrahouse-github-control-state-polished-lioness]%0Adata.external.env: Reading...%0Adata.external.env: Read complete after 0s [id=-]%0Amodule.ih_8_repos["github-control"].github_repository.repo: Refreshing state... [id=github-control]%0Amodule.ih8_tf_template.github_repository.repo: Refreshing state... [id=terraform-template]%0Amodule.ih_tf_template.github_repository.repo: Refreshing state... [id=terraform-template]%0Agithub_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]%0Agithub_team.dev: Refreshing state... [id=7332815]%0Agithub_organization_settings.infrahouse: Refreshing state... [id=121984263]%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy.admin: Reading...%0Adata.aws_secretsmanager_secrets.gh_secrets: Reading...%0Adata.aws_ssm_parameter.gh_secrets_namespace: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.ih_8_repos["github-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=github-control:akuzminsky]%0Amodule.ih_8_repos["github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=github-control:GH_TOKEN]%0Amodule.infrahouse8-github-control.module.state-bucket.aws_dynamodb_table.terraform_locks: Refreshing state... [id=infrahouse-github-control-state-polished-lioness]%0Amodule.ih_8_repos["github-control"].github_branch_default.main: Refreshing state... [id=github-control]%0Adata.aws_secretsmanager_secrets.gh_secrets: Read complete after 0s [id=us-west-1]%0Adata.aws_ssm_parameter.gh_secrets_namespace: Read complete after 0s [id=gh_secrets_namespace]%0Aaws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__PYPI_API_TOKEN-5N8UtG]%0Aaws_secretsmanager_secret.codacy_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__CODACY_PROJECT_TOKEN-fhlOS2]%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.github-trust: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.github-trust: Read complete after 0s [id=2229426295]%0Amodule.infrahouse8-github-control.module.gha-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-github-control-github]%0Amodule.ih_tf_template.github_team_repository.dev[0]: Refreshing state... [id=7332815:terraform-template]%0Agithub_team_members.dev: Refreshing state... [id=7332815]%0Adata.aws_secretsmanager_secret_version.codacy_api_token: Reading...%0Adata.aws_secretsmanager_secret_version.pypi_api_token: Reading...%0Adata.aws_secretsmanager_secret_version.codacy_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__CODACY_PROJECT_TOKEN-fhlOS2|AWSCURRENT]%0Adata.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 1s [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__PYPI_API_TOKEN-5N8UtG|AWSCURRENT]%0Amodule.repos["terraform-aws-website-pod"].github_repository.repo: Refreshing state... [id=terraform-aws-website-pod]%0Amodule.repos["puppet-code"].github_repository.repo: Refreshing state... [id=puppet-code]%0Amodule.repos["aws-control"].github_repository.repo: Refreshing state... [id=aws-control]%0Amodule.repos["terraform-aws-service-network"].github_repository.repo: Refreshing state... [id=terraform-aws-service-network]%0Amodule.repos["aws-control-289256138624"].github_repository.repo: Refreshing state... [id=aws-control-289256138624]%0Amodule.repos["terraform-aws-gh-identity-provider"].github_repository.repo: Refreshing state... [id=terraform-aws-gh-identity-provider]%0Amodule.repos["aws-control-493370826424"].github_repository.repo: Refreshing state... [id=aws-control-493370826424]%0Amodule.repos["aws-control-303467602807"].github_repository.repo: Refreshing state... [id=aws-control-303467602807]%0Amodule.repos["infrahouse-com"].github_repository.repo: Refreshing state... [id=infrahouse-com]%0Amodule.repos["terraform-aws-cloud-init"].github_repository.repo: Refreshing state... [id=terraform-aws-cloud-init]%0Amodule.repos["terraform-aws-gha-admin"].github_repository.repo: Refreshing state... [id=terraform-aws-gha-admin]%0Amodule.repos["terraform-aws-state-manager"].github_repository.repo: Refreshing state... [id=terraform-aws-state-manager]%0Amodule.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]%0Amodule.repos["proxysql-sandbox"].github_repository.repo: Refreshing state... [id=proxysql-sandbox]%0Amodule.repos["terraform-aws-instance-profile"].github_repository.repo: Refreshing state... [id=terraform-aws-instance-profile]%0Amodule.repos["terraform-aws-state-bucket"].github_repository.repo: Refreshing state... [id=terraform-aws-state-bucket]%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy.admin: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.repos["infrahouse-website-infra"].github_repository.repo: Refreshing state... [id=infrahouse-website-infra]%0Amodule.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]%0Amodule.repos["terraform-aws-debian-repo"].github_repository.repo: Refreshing state... [id=terraform-aws-debian-repo]%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.admin-trust: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.admin-trust: Read complete after 0s [id=91398067]%0Amodule.ih_8_repos["github-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOI2vu7M4CAici]%0Amodule.infrahouse8-github-control.module.state-bucket.aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-github-control-state]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.assume: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=262017685]%0Amodule.infrahouse8-github-control.module.gha-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-github-control-admin]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-github-control-state-manager]%0Amodule.infrahouse8-github-control.module.gha-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-github-control-admin-20231016152934892800000002]%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=2246898652]%0Amodule.infrahouse8-github-control.module.gha-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::303467602807:policy/ih-tf-github-control-github20231016152934873800000001]%0Amodule.infrahouse8-github-control.module.gha-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-github-control-github-20231016152935026000000003]%0Amodule.infrahouse8-github-control.module.state-bucket.aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-github-control-state]%0Amodule.infrahouse8-github-control.module.state-bucket.aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-github-control-state]%0Amodule.infrahouse8-github-control.module.state-bucket.aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-github-control-state]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_rw: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_ro: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=3098380055]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=19153250]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_policy.permissions_rw: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-github-control-state-manager-rw20231016152936864600000002]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_policy.permissions_ro: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-github-control-state-manager-ro20231016152936860000000001]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]: Refreshing state... [id=ih-tf-github-control-state-manager-20231016152937028600000004]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_role_policy_attachment.state-manager-ro: Refreshing state... [id=ih-tf-github-control-state-manager-20231016152936987100000003]%0Amodule.repos["terraform-aws-instance-profile"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-instance-profile]%0Amodule.repos["terraform-aws-gha-admin"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-gha-admin]%0Amodule.repos["terraform-aws-debian-repo"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-debian-repo]%0Amodule.repos["terraform-aws-gh-identity-provider"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-gh-identity-provider]%0Amodule.repos["terraform-aws-cloud-init"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-cloud-init]%0Amodule.repos["terraform-aws-service-network"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-service-network]%0Amodule.repos["terraform-aws-state-bucket"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-state-bucket]%0Amodule.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]%0Amodule.repos["infrahouse-com"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-com]%0Amodule.repos["aws-control-493370826424"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-493370826424]%0Amodule.repos["aws-control-303467602807"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-303467602807]%0Amodule.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]%0Amodule.repos["terraform-aws-state-manager"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-state-manager]%0Amodule.repos["terraform-aws-website-pod"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-website-pod]%0Amodule.repos["infrahouse-website-infra"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-website-infra]%0Amodule.repos["proxysql-sandbox"].github_team_repository.dev: Refreshing state... [id=7332815:proxysql-sandbox]%0Amodule.repos["aws-control-289256138624"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-289256138624]%0Amodule.repos["puppet-code"].github_team_repository.dev: Refreshing state... [id=7332815:puppet-code]%0Amodule.repos["aws-control"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control]%0Amodule.repos["terraform-aws-state-manager"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-state-manager:GH_TOKEN]%0Amodule.repos["terraform-aws-service-network"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-service-network:GH_TOKEN]%0Amodule.repos["terraform-aws-website-pod"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-website-pod:GH_TOKEN]%0Amodule.repos["aws-control-493370826424"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-493370826424:AWS_DEFAULT_REGION]%0Amodule.repos["puppet-code"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=puppet-code:GH_TOKEN]%0Amodule.repos["aws-control-289256138624"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-289256138624:GH_TOKEN]%0Amodule.repos["terraform-aws-state-bucket"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-state-bucket:GH_TOKEN]%0Amodule.repos["aws-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control:GH_TOKEN]%0Amodule.repos["infrahouse-toolkit"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:GH_TOKEN]%0Amodule.repos["proxysql-sandbox"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=proxysql-sandbox:GH_TOKEN]%0Amodule.repos["terraform-aws-debian-repo"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-debian-repo:GH_TOKEN]%0Amodule.repos["puppet-code"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=puppet-code:AWS_DEFAULT_REGION]%0Amodule.repos["aws-control"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control:AWS_DEFAULT_REGION]%0Amodule.repos["terraform-aws-gha-admin"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-gha-admin:GH_TOKEN]%0Amodule.repos["infrahouse-toolkit"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-toolkit:AWS_DEFAULT_REGION]%0Amodule.repos["terraform-aws-cloud-init"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-cloud-init:GH_TOKEN]%0Amodule.repos["aws-control-303467602807"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-303467602807:GH_TOKEN]%0Amodule.repos["terraform-aws-instance-profile"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-instance-profile:GH_TOKEN]%0Amodule.repos["aws-control-493370826424"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-493370826424:GH_TOKEN]%0Amodule.repos["infrahouse-com"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-com:GH_TOKEN]%0Amodule.repos["infrahouse-com"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-com:AWS_DEFAULT_REGION]%0Amodule.repos["infrahouse-toolkit"].github_actions_secret.secret["CODACY_PROJECT_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:CODACY_PROJECT_TOKEN]%0Amodule.repos["terraform-aws-gh-identity-provider"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-gh-identity-provider:GH_TOKEN]%0Amodule.repos["cookiecutter-github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=cookiecutter-github-control:GH_TOKEN]%0Amodule.repos["infrahouse-website-infra"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-website-infra:AWS_DEFAULT_REGION]%0Amodule.repos["infrahouse-toolkit"].github_actions_secret.secret["PYPI_API_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]%0Amodule.repos["aws-control-303467602807"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-303467602807:AWS_DEFAULT_REGION]%0Amodule.repos["infrahouse-website-infra"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-website-infra:GH_TOKEN]%0Amodule.repos["aws-control-289256138624"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-289256138624:AWS_DEFAULT_REGION]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # module.repos["test"].github_actions_secret.secret["GH_TOKEN"] will be created%0A  + resource "github_actions_secret" "secret" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "test"%0A      + secret_name     = "GH_TOKEN"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # module.repos["test"].github_repository.repo will be created%0A  + resource "github_repository" "repo" {%0A      + allow_auto_merge            = false%0A      + allow_merge_commit          = true%0A      + allow_rebase_merge          = true%0A      + allow_squash_merge          = true%0A      + archived                    = false%0A      + default_branch              = (known after apply)%0A      + delete_branch_on_merge      = false%0A      + description                 = "Module that creates an S3 bucket for a Terraform state."%0A      + etag                        = (known after apply)%0A      + full_name                   = (known after apply)%0A      + git_clone_url               = (known after apply)%0A      + has_issues                  = true%0A      + html_url                    = (known after apply)%0A      + http_clone_url              = (known after apply)%0A      + id                          = (known after apply)%0A      + merge_commit_message        = "PR_TITLE"%0A      + merge_commit_title          = "MERGE_MESSAGE"%0A      + name                        = "test"%0A      + node_id                     = (known after apply)%0A      + primary_language            = (known after apply)%0A      + private                     = (known after apply)%0A      + repo_id                     = (known after apply)%0A      + squash_merge_commit_message = "COMMIT_MESSAGES"%0A      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"%0A      + ssh_clone_url               = (known after apply)%0A      + svn_url                     = (known after apply)%0A      + topics                      = (known after apply)%0A      + visibility                  = "public"%0A    }%0A%0A  # module.repos["test"].github_team_repository.dev will be created%0A  + resource "github_team_repository" "dev" {%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + permission = "push"%0A      + repository = "test"%0A      + team_id    = "7332815"%0A    }%0A%0A  # module.infrahouse8-github-control.module.gha-admin.aws_iam_policy.github will be updated in-place%0A  ~ resource "aws_iam_policy" "github" {%0A        id          = "arn:aws:iam::303467602807:policy/ih-tf-github-control-github20231016152934873800000001"%0A        name        = "ih-tf-github-control-github20231016152934873800000001"%0A      ~ policy      = jsonencode(%0A          ~ {%0A              ~ Statement = [%0A                  ~ {%0A                      ~ Resource = "*" -> [%0A                          + "arn:aws:iam::303467602807:role/ih-tf-github-control-admin",%0A                          + "arn:aws:iam::289256138624:role/ih-tf-terraform-control",%0A                          + "arn:aws:iam::289256138624:role/ih-tf-github-control-state-manager",%0A                        ]%0A                      - Sid      = "VisualEditor0"%0A                        # (2 unchanged attributes hidden)%0A                    },%0A                ]%0A                # (1 unchanged attribute hidden)%0A            }%0A        )%0A        tags        = {}%0A        # (5 unchanged attributes hidden)%0A    }%0A%0APlan: 3 to add, 1 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtZ2l0aHViLWNvbnRyb2wtc3RhdGUvdGVycmFmb3JtLnRmc3RhdGUiOiB7InN1Y2Nlc3MiOiB0cnVlLCAic3Rkb3V0IjogIltjb21tYW5kXS9ob21lL3J1bm5lci93b3JrL190ZW1wLzQ5OGQwMGM1LTVkZmYtNGZlMS1iY2UzLTVkYTRhZTJhZDk1Yy90ZXJyYWZvcm0tYmluIHBsYW4gLXZhci1maWxlPWNvbmZpZ3VyYXRpb24udGZ2YXJzIC1uby1jb2xvciAtLW91dD10Zi5wbGFuXG5tb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLnN0YXRlLWJ1Y2tldC5yYW5kb21fcGV0LnN1ZmZpeDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1naXRodWItY29udHJvbC1zdGF0ZS1wb2xpc2hlZC1saW9uZXNzXVxuZGF0YS5leHRlcm5hbC5lbnY6IFJlYWRpbmcuLi5cbmRhdGEuZXh0ZXJuYWwuZW52OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0tXVxubW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbF1cbm1vZHVsZS5paDhfdGZfdGVtcGxhdGUuZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLXRlbXBsYXRlXVxubW9kdWxlLmloX3RmX3RlbXBsYXRlLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS10ZW1wbGF0ZV1cbmdpdGh1Yl9tZW1iZXJzaGlwLmluZnJhaG91c2VbXCJha3V6bWluc2t5XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlOmFrdXptaW5za3ldXG5naXRodWJfdGVhbS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTVdXG5naXRodWJfb3JnYW5pemF0aW9uX3NldHRpbmdzLmluZnJhaG91c2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTEyMTk4NDI2M11cbm1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW46IFJlYWRpbmcuLi5cbmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldHMuZ2hfc2VjcmV0czogUmVhZGluZy4uLlxuZGF0YS5hd3Nfc3NtX3BhcmFtZXRlci5naF9zZWNyZXRzX25hbWVzcGFjZTogUmVhZGluZy4uLlxubW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4uZGF0YS5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVhZGluZy4uLlxubW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeV9jb2xsYWJvcmF0b3IuY29sbGFib3JhdG9yc1tcImFrdXptaW5za3lcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sOmFrdXptaW5za3ldXG5tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6R0hfVE9LRU5dXG5tb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLnN0YXRlLWJ1Y2tldC5hd3NfZHluYW1vZGJfdGFibGUudGVycmFmb3JtX2xvY2tzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWdpdGh1Yi1jb250cm9sLXN0YXRlLXBvbGlzaGVkLWxpb25lc3NdXG5tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfZGVmYXVsdC5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbF1cbmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldHMuZ2hfc2VjcmV0czogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9dXMtd2VzdC0xXVxuZGF0YS5hd3Nfc3NtX3BhcmFtZXRlci5naF9zZWNyZXRzX25hbWVzcGFjZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9Z2hfc2VjcmV0c19uYW1lc3BhY2VdXG5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LnB5cGlfYXBpX3Rva2VuOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTozMDM0Njc2MDI4MDc6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fUFlQSV9BUElfVE9LRU4tNU44VXRHXVxuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5jb2RhY3lfYXBpX3Rva2VuOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTozMDM0Njc2MDI4MDc6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fQ09EQUNZX1BST0pFQ1RfVE9LRU4tZmhsT1MyXVxubW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4uZGF0YS5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXVxubW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItdHJ1c3Q6IFJlYWRpbmcuLi5cbm1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXRydXN0OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMjI5NDI2Mjk1XVxubW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4uYXdzX2lhbV9yb2xlLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtZ2l0aHViLWNvbnRyb2wtZ2l0aHViXVxubW9kdWxlLmloX3RmX3RlbXBsYXRlLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2WzBdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS10ZW1wbGF0ZV1cbmdpdGh1Yl90ZWFtX21lbWJlcnMuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1XVxuZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24uY29kYWN5X2FwaV90b2tlbjogUmVhZGluZy4uLlxuZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ucHlwaV9hcGlfdG9rZW46IFJlYWRpbmcuLi5cbmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLmNvZGFjeV9hcGlfdG9rZW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjMwMzQ2NzYwMjgwNzpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX19DT0RBQ1lfUFJPSkVDVF9UT0tFTi1maGxPUzJ8QVdTQ1VSUkVOVF1cbmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLnB5cGlfYXBpX3Rva2VuOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTozMDM0Njc2MDI4MDc6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fUFlQSV9BUElfVE9LRU4tNU44VXRHfEFXU0NVUlJFTlRdXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXdlYnNpdGUtcG9kXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3Mtd2Vic2l0ZS1wb2RdXG5tb2R1bGUucmVwb3NbXCJwdXBwZXQtY29kZVwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1wdXBwZXQtY29kZV1cbm1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1zZXJ2aWNlLW5ldHdvcmtcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1zZXJ2aWNlLW5ldHdvcmtdXG5tb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naC1pZGVudGl0eS1wcm92aWRlclwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWdoLWlkZW50aXR5LXByb3ZpZGVyXVxubW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNF1cbm1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDddXG5tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLWNvbVwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWNvbV1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtY2xvdWQtaW5pdFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWNsb3VkLWluaXRdXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWdoYS1hZG1pblwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWdoYS1hZG1pbl1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtc3RhdGUtbWFuYWdlclwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXN0YXRlLW1hbmFnZXJdXG5tb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Y29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXVxubW9kdWxlLnJlcG9zW1wicHJveHlzcWwtc2FuZGJveFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1wcm94eXNxbC1zYW5kYm94XVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1pbnN0YW5jZS1wcm9maWxlXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtaW5zdGFuY2UtcHJvZmlsZV1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtc3RhdGUtYnVja2V0XCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3Mtc3RhdGUtYnVja2V0XVxubW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbjogUmVhZCBjb21wbGV0ZSBhZnRlciAycyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc11cbm1vZHVsZS5yZXBvc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFdXG5tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0XVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1kZWJpYW4tcmVwb1wiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWRlYmlhbi1yZXBvXVxubW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi10cnVzdDogUmVhZGluZy4uLlxubW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi10cnVzdDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9OTEzOTgwNjddXG5tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfcHJvdGVjdGlvbi5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1CUFJfa3dET0kydnU3TTRDQWljaV1cbm1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuc3RhdGUtYnVja2V0LmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWdpdGh1Yi1jb250cm9sLXN0YXRlXVxubW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4ubW9kdWxlLnN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWRpbmcuLi5cbm1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLm1vZHVsZS5zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yNjIwMTc2ODVdXG5tb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5hd3NfaWFtX3JvbGUuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWdpdGh1Yi1jb250cm9sLWFkbWluXVxubW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4ubW9kdWxlLnN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlLnN0YXRlLW1hbmFnZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWdpdGh1Yi1jb250cm9sLXN0YXRlLW1hbmFnZXJdXG5tb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWdpdGh1Yi1jb250cm9sLWFkbWluLTIwMjMxMDE2MTUyOTM0ODkyODAwMDAwMDAyXVxubW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbm1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMjQ2ODk4NjUyXVxubW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4uYXdzX2lhbV9wb2xpY3kuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9paC10Zi1naXRodWItY29udHJvbC1naXRodWIyMDIzMTAxNjE1MjkzNDg3MzgwMDAwMDAwMV1cbm1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWdpdGh1Yi1jb250cm9sLWdpdGh1Yi0yMDIzMTAxNjE1MjkzNTAyNjAwMDAwMDAwM11cbm1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuc3RhdGUtYnVja2V0LmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLWNvbnRyb2wtc3RhdGVdXG5tb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLnN0YXRlLWJ1Y2tldC5hd3NfczNfYnVja2V0X3ZlcnNpb25pbmcuZW5hYmxlZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1naXRodWItY29udHJvbC1zdGF0ZV1cbm1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuc3RhdGUtYnVja2V0LmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWdpdGh1Yi1jb250cm9sLXN0YXRlXVxubW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4ubW9kdWxlLnN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ydzogUmVhZGluZy4uLlxubW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4ubW9kdWxlLnN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ybzogUmVhZGluZy4uLlxubW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4ubW9kdWxlLnN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ybzogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzA5ODM4MDA1NV1cbm1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLm1vZHVsZS5zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcnc6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE5MTUzMjUwXVxubW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4ubW9kdWxlLnN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcnc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWdpdGh1Yi1jb250cm9sLXN0YXRlLW1hbmFnZXItcncyMDIzMTAxNjE1MjkzNjg2NDYwMDAwMDAwMl1cbm1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLm1vZHVsZS5zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zX3JvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS9paC10Zi1naXRodWItY29udHJvbC1zdGF0ZS1tYW5hZ2VyLXJvMjAyMzEwMTYxNTI5MzY4NjAwMDAwMDAwMDFdXG5tb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5tb2R1bGUuc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlci1yd1swXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtZ2l0aHViLWNvbnRyb2wtc3RhdGUtbWFuYWdlci0yMDIzMTAxNjE1MjkzNzAyODYwMDAwMDAwNF1cbm1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLm1vZHVsZS5zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyLXJvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1naXRodWItY29udHJvbC1zdGF0ZS1tYW5hZ2VyLTIwMjMxMDE2MTUyOTM2OTg3MTAwMDAwMDAzXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1pbnN0YW5jZS1wcm9maWxlXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS1hd3MtaW5zdGFuY2UtcHJvZmlsZV1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZ2hhLWFkbWluXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS1hd3MtZ2hhLWFkbWluXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1kZWJpYW4tcmVwb1wiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLWRlYmlhbi1yZXBvXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naC1pZGVudGl0eS1wcm92aWRlclwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLWdoLWlkZW50aXR5LXByb3ZpZGVyXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1jbG91ZC1pbml0XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS1hd3MtY2xvdWQtaW5pdF1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtc2VydmljZS1uZXR3b3JrXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS1hd3Mtc2VydmljZS1uZXR3b3JrXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1zdGF0ZS1idWNrZXRcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1zdGF0ZS1idWNrZXRdXG5tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6aW5mcmFob3VzZS10b29sa2l0XVxubW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS1jb21cIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6aW5mcmFob3VzZS1jb21dXG5tb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6YXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XVxubW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN11cbm1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTpjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xdXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXN0YXRlLW1hbmFnZXJcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1zdGF0ZS1tYW5hZ2VyXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy13ZWJzaXRlLXBvZFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLXdlYnNpdGUtcG9kXVxubW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYV1cbm1vZHVsZS5yZXBvc1tcInByb3h5c3FsLXNhbmRib3hcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6cHJveHlzcWwtc2FuZGJveF1cbm1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTphd3MtY29udHJvbC0yODkyNTYxMzg2MjRdXG5tb2R1bGUucmVwb3NbXCJwdXBwZXQtY29kZVwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTpwdXBwZXQtY29kZV1cbm1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmF3cy1jb250cm9sXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1zdGF0ZS1tYW5hZ2VyXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1zdGF0ZS1tYW5hZ2VyOkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1zZXJ2aWNlLW5ldHdvcmtcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXNlcnZpY2UtbmV0d29yazpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtd2Vic2l0ZS1wb2RcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXdlYnNpdGUtcG9kOkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNDpBV1NfREVGQVVMVF9SRUdJT05dXG5tb2R1bGUucmVwb3NbXCJwdXBwZXQtY29kZVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXB1cHBldC1jb2RlOkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0OkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1zdGF0ZS1idWNrZXRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXN0YXRlLWJ1Y2tldDpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2w6R0hfVE9LRU5dXG5tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXQ6R0hfVE9LRU5dXG5tb2R1bGUucmVwb3NbXCJwcm94eXNxbC1zYW5kYm94XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cHJveHlzcWwtc2FuZGJveDpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZGViaWFuLXJlcG9cIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWRlYmlhbi1yZXBvOkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1wicHVwcGV0LWNvZGVcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cHVwcGV0LWNvZGU6QVdTX0RFRkFVTFRfUkVHSU9OXVxubW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2w6QVdTX0RFRkFVTFRfUkVHSU9OXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naGEtYWRtaW5cIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWdoYS1hZG1pbjpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXQ6QVdTX0RFRkFVTFRfUkVHSU9OXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1jbG91ZC1pbml0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1jbG91ZC1pbml0OkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3OkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1pbnN0YW5jZS1wcm9maWxlXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1pbnN0YW5jZS1wcm9maWxlOkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0OkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS1jb21cIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWNvbTpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtY29tXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtY29tOkFXU19ERUZBVUxUX1JFR0lPTl1cbm1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQ09EQUNZX1BST0pFQ1RfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdDpDT0RBQ1lfUFJPSkVDVF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZ2gtaWRlbnRpdHktcHJvdmlkZXJcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWdoLWlkZW50aXR5LXByb3ZpZGVyOkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Y29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sOkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYTpBV1NfREVGQVVMVF9SRUdJT05dXG5tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIlBZUElfQVBJX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXQ6UFlQSV9BUElfVE9LRU5dXG5tb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3OkFXU19ERUZBVUxUX1JFR0lPTl1cbm1vZHVsZS5yZXBvc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYTpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQ6QVdTX0RFRkFVTFRfUkVHSU9OXVxuXG5UZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uXG5wbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6XG4gICsgY3JlYXRlXG4gIH4gdXBkYXRlIGluLXBsYWNlXG5cblRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOlxuXG4gICMgbW9kdWxlLnJlcG9zW1widGVzdFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl0gd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJnaXRodWJfYWN0aW9uc19zZWNyZXRcIiBcInNlY3JldFwiIHtcbiAgICAgICsgY3JlYXRlZF9hdCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBsYWludGV4dF92YWx1ZSA9IChzZW5zaXRpdmUgdmFsdWUpXG4gICAgICArIHJlcG9zaXRvcnkgICAgICA9IFwidGVzdFwiXG4gICAgICArIHNlY3JldF9uYW1lICAgICA9IFwiR0hfVE9LRU5cIlxuICAgICAgKyB1cGRhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG4gICMgbW9kdWxlLnJlcG9zW1widGVzdFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiZ2l0aHViX3JlcG9zaXRvcnlcIiBcInJlcG9cIiB7XG4gICAgICArIGFsbG93X2F1dG9fbWVyZ2UgICAgICAgICAgICA9IGZhbHNlXG4gICAgICArIGFsbG93X21lcmdlX2NvbW1pdCAgICAgICAgICA9IHRydWVcbiAgICAgICsgYWxsb3dfcmViYXNlX21lcmdlICAgICAgICAgID0gdHJ1ZVxuICAgICAgKyBhbGxvd19zcXVhc2hfbWVyZ2UgICAgICAgICAgPSB0cnVlXG4gICAgICArIGFyY2hpdmVkICAgICAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICArIGRlZmF1bHRfYnJhbmNoICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZGVsZXRlX2JyYW5jaF9vbl9tZXJnZSAgICAgID0gZmFsc2VcbiAgICAgICsgZGVzY3JpcHRpb24gICAgICAgICAgICAgICAgID0gXCJNb2R1bGUgdGhhdCBjcmVhdGVzIGFuIFMzIGJ1Y2tldCBmb3IgYSBUZXJyYWZvcm0gc3RhdGUuXCJcbiAgICAgICsgZXRhZyAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBmdWxsX25hbWUgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGdpdF9jbG9uZV91cmwgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaGFzX2lzc3VlcyAgICAgICAgICAgICAgICAgID0gdHJ1ZVxuICAgICAgKyBodG1sX3VybCAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGh0dHBfY2xvbmVfdXJsICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBtZXJnZV9jb21taXRfbWVzc2FnZSAgICAgICAgPSBcIlBSX1RJVExFXCJcbiAgICAgICsgbWVyZ2VfY29tbWl0X3RpdGxlICAgICAgICAgID0gXCJNRVJHRV9NRVNTQUdFXCJcbiAgICAgICsgbmFtZSAgICAgICAgICAgICAgICAgICAgICAgID0gXCJ0ZXN0XCJcbiAgICAgICsgbm9kZV9pZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwcmltYXJ5X2xhbmd1YWdlICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHByaXZhdGUgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcmVwb19pZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzcXVhc2hfbWVyZ2VfY29tbWl0X21lc3NhZ2UgPSBcIkNPTU1JVF9NRVNTQUdFU1wiXG4gICAgICArIHNxdWFzaF9tZXJnZV9jb21taXRfdGl0bGUgICA9IFwiQ09NTUlUX09SX1BSX1RJVExFXCJcbiAgICAgICsgc3NoX2Nsb25lX3VybCAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzdm5fdXJsICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRvcGljcyAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdmlzaWJpbGl0eSAgICAgICAgICAgICAgICAgID0gXCJwdWJsaWNcIlxuICAgIH1cblxuICAjIG1vZHVsZS5yZXBvc1tcInRlc3RcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXYgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJnaXRodWJfdGVhbV9yZXBvc2l0b3J5XCIgXCJkZXZcIiB7XG4gICAgICArIGV0YWcgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBlcm1pc3Npb24gPSBcInB1c2hcIlxuICAgICAgKyByZXBvc2l0b3J5ID0gXCJ0ZXN0XCJcbiAgICAgICsgdGVhbV9pZCAgICA9IFwiNzMzMjgxNVwiXG4gICAgfVxuXG4gICMgbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4uYXdzX2lhbV9wb2xpY3kuZ2l0aHViIHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZVxuICB+IHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcImdpdGh1YlwiIHtcbiAgICAgICAgaWQgICAgICAgICAgPSBcImFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L2loLXRmLWdpdGh1Yi1jb250cm9sLWdpdGh1YjIwMjMxMDE2MTUyOTM0ODczODAwMDAwMDAxXCJcbiAgICAgICAgbmFtZSAgICAgICAgPSBcImloLXRmLWdpdGh1Yi1jb250cm9sLWdpdGh1YjIwMjMxMDE2MTUyOTM0ODczODAwMDAwMDAxXCJcbiAgICAgIH4gcG9saWN5ICAgICAgPSBqc29uZW5jb2RlKFxuICAgICAgICAgIH4ge1xuICAgICAgICAgICAgICB+IFN0YXRlbWVudCA9IFtcbiAgICAgICAgICAgICAgICAgIH4ge1xuICAgICAgICAgICAgICAgICAgICAgIH4gUmVzb3VyY2UgPSBcIipcIiAtPiBbXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJhcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnJvbGUvaWgtdGYtZ2l0aHViLWNvbnRyb2wtYWRtaW5cIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cm9sZS9paC10Zi10ZXJyYWZvcm0tY29udHJvbFwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpyb2xlL2loLXRmLWdpdGh1Yi1jb250cm9sLXN0YXRlLW1hbmFnZXJcIixcbiAgICAgICAgICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgICAgICAgICAtIFNpZCAgICAgID0gXCJWaXN1YWxFZGl0b3IwXCJcbiAgICAgICAgICAgICAgICAgICAgICAgICMgKDIgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgICAjICgxIHVuY2hhbmdlZCBhdHRyaWJ1dGUgaGlkZGVuKVxuICAgICAgICAgICAgfVxuICAgICAgICApXG4gICAgICAgIHRhZ3MgICAgICAgID0ge31cbiAgICAgICAgIyAoNSB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG4gICAgfVxuXG5QbGFuOiAzIHRvIGFkZCwgMSB0byBjaGFuZ2UsIDAgdG8gZGVzdHJveS5cblxuXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXG5cblNhdmVkIHRoZSBwbGFuIHRvOiB0Zi5wbGFuXG5cblRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OlxuICAgIHRlcnJhZm9ybSBhcHBseSBcInRmLnBsYW5cIlxuOjpkZWJ1Zzo6VGVycmFmb3JtIGV4aXRlZCB3aXRoIGNvZGUgMC5cbjo6ZGVidWc6OnN0ZG91dDogbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5zdGF0ZS1idWNrZXQucmFuZG9tX3BldC5zdWZmaXg6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLWNvbnRyb2wtc3RhdGUtcG9saXNoZWQtbGlvbmVzc10lMEFkYXRhLmV4dGVybmFsLmVudjogUmVhZGluZy4uLiUwQWRhdGEuZXh0ZXJuYWwuZW52OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0tXSUwQW1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2xdJTBBbW9kdWxlLmloOF90Zl90ZW1wbGF0ZS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tdGVtcGxhdGVdJTBBbW9kdWxlLmloX3RmX3RlbXBsYXRlLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS10ZW1wbGF0ZV0lMEFnaXRodWJfbWVtYmVyc2hpcC5pbmZyYWhvdXNlW1wiYWt1em1pbnNreVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZTpha3V6bWluc2t5XSUwQWdpdGh1Yl90ZWFtLmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNV0lMEFnaXRodWJfb3JnYW5pemF0aW9uX3NldHRpbmdzLmluZnJhaG91c2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTEyMTk4NDI2M10lMEFtb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0cy5naF9zZWNyZXRzOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3Nfc3NtX3BhcmFtZXRlci5naF9zZWNyZXRzX25hbWVzcGFjZTogUmVhZGluZy4uLiUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5X2NvbGxhYm9yYXRvci5jb2xsYWJvcmF0b3JzW1wiYWt1em1pbnNreVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6YWt1em1pbnNreV0lMEFtb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6R0hfVE9LRU5dJTBBbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5zdGF0ZS1idWNrZXQuYXdzX2R5bmFtb2RiX3RhYmxlLnRlcnJhZm9ybV9sb2NrczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1naXRodWItY29udHJvbC1zdGF0ZS1wb2xpc2hlZC1saW9uZXNzXSUwQW1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9kZWZhdWx0Lm1haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sXSUwQWRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldHMuZ2hfc2VjcmV0czogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9dXMtd2VzdC0xXSUwQWRhdGEuYXdzX3NzbV9wYXJhbWV0ZXIuZ2hfc2VjcmV0c19uYW1lc3BhY2U6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWdoX3NlY3JldHNfbmFtZXNwYWNlXSUwQWF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQucHlwaV9hcGlfdG9rZW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjMwMzQ2NzYwMjgwNzpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX19QWVBJX0FQSV9UT0tFTi01TjhVdEddJTBBYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5jb2RhY3lfYXBpX3Rva2VuOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTozMDM0Njc2MDI4MDc6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fQ09EQUNZX1BST0pFQ1RfVE9LRU4tZmhsT1MyXSUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV0lMEFtb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi10cnVzdDogUmVhZGluZy4uLiUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXRydXN0OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMjI5NDI2Mjk1XSUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmF3c19pYW1fcm9sZS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWdpdGh1Yi1jb250cm9sLWdpdGh1Yl0lMEFtb2R1bGUuaWhfdGZfdGVtcGxhdGUuZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXZbMF06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLXRlbXBsYXRlXSUwQWdpdGh1Yl90ZWFtX21lbWJlcnMuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1XSUwQWRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLmNvZGFjeV9hcGlfdG9rZW46IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5weXBpX2FwaV90b2tlbjogUmVhZGluZy4uLiUwQWRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLmNvZGFjeV9hcGlfdG9rZW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjMwMzQ2NzYwMjgwNzpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX19DT0RBQ1lfUFJPSkVDVF9UT0tFTi1maGxPUzJ8QVdTQ1VSUkVOVF0lMEFkYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5weXBpX2FwaV90b2tlbjogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6MzAzNDY3NjAyODA3OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX1BZUElfQVBJX1RPS0VOLTVOOFV0R3xBV1NDVVJSRU5UXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtd2Vic2l0ZS1wb2RcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy13ZWJzaXRlLXBvZF0lMEFtb2R1bGUucmVwb3NbXCJwdXBwZXQtY29kZVwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1wdXBwZXQtY29kZV0lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbF0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXNlcnZpY2UtbmV0d29ya1wiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXNlcnZpY2UtbmV0d29ya10lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZ2gtaWRlbnRpdHktcHJvdmlkZXJcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1naC1pZGVudGl0eS1wcm92aWRlcl0lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XSUwQW1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDddJTBBbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS1jb21cIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1jb21dJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1jbG91ZC1pbml0XCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtY2xvdWQtaW5pdF0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWdoYS1hZG1pblwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWdoYS1hZG1pbl0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXN0YXRlLW1hbmFnZXJcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1zdGF0ZS1tYW5hZ2VyXSUwQW1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1jb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xdJTBBbW9kdWxlLnJlcG9zW1wicHJveHlzcWwtc2FuZGJveFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1wcm94eXNxbC1zYW5kYm94XSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtaW5zdGFuY2UtcHJvZmlsZVwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWluc3RhbmNlLXByb2ZpbGVdJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1zdGF0ZS1idWNrZXRcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1zdGF0ZS1idWNrZXRdJTBBbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbjogUmVhZCBjb21wbGV0ZSBhZnRlciAycyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXSUwQW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXRdJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1kZWJpYW4tcmVwb1wiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWRlYmlhbi1yZXBvXSUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tdHJ1c3Q6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLXRydXN0OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD05MTM5ODA2N10lMEFtb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfcHJvdGVjdGlvbi5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1CUFJfa3dET0kydnU3TTRDQWljaV0lMEFtb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLnN0YXRlLWJ1Y2tldC5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1naXRodWItY29udHJvbC1zdGF0ZV0lMEFtb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5tb2R1bGUuc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLm1vZHVsZS5zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yNjIwMTc2ODVdJTBBbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4uYXdzX2lhbV9yb2xlLmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1naXRodWItY29udHJvbC1hZG1pbl0lMEFtb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5tb2R1bGUuc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGUuc3RhdGUtbWFuYWdlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtZ2l0aHViLWNvbnRyb2wtc3RhdGUtbWFuYWdlcl0lMEFtb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWdpdGh1Yi1jb250cm9sLWFkbWluLTIwMjMxMDE2MTUyOTM0ODkyODAwMDAwMDAyXSUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIyNDY4OTg2NTJdJTBBbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4uYXdzX2lhbV9wb2xpY3kuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9paC10Zi1naXRodWItY29udHJvbC1naXRodWIyMDIzMTAxNjE1MjkzNDg3MzgwMDAwMDAwMV0lMEFtb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1naXRodWItY29udHJvbC1naXRodWItMjAyMzEwMTYxNTI5MzUwMjYwMDAwMDAwMDNdJTBBbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5zdGF0ZS1idWNrZXQuYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24uZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1naXRodWItY29udHJvbC1zdGF0ZV0lMEFtb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLnN0YXRlLWJ1Y2tldC5hd3NfczNfYnVja2V0X3ZlcnNpb25pbmcuZW5hYmxlZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1naXRodWItY29udHJvbC1zdGF0ZV0lMEFtb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLnN0YXRlLWJ1Y2tldC5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sucHVibGljX2FjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1naXRodWItY29udHJvbC1zdGF0ZV0lMEFtb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5tb2R1bGUuc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3J3OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4ubW9kdWxlLnN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ybzogUmVhZGluZy4uLiUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLm1vZHVsZS5zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcm86IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTMwOTgzODAwNTVdJTBBbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4ubW9kdWxlLnN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ydzogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTkxNTMyNTBdJTBBbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4ubW9kdWxlLnN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcnc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWdpdGh1Yi1jb250cm9sLXN0YXRlLW1hbmFnZXItcncyMDIzMTAxNjE1MjkzNjg2NDYwMDAwMDAwMl0lMEFtb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5tb2R1bGUuc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9uc19ybzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvaWgtdGYtZ2l0aHViLWNvbnRyb2wtc3RhdGUtbWFuYWdlci1ybzIwMjMxMDE2MTUyOTM2ODYwMDAwMDAwMDAxXSUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLm1vZHVsZS5zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyLXJ3WzBdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1naXRodWItY29udHJvbC1zdGF0ZS1tYW5hZ2VyLTIwMjMxMDE2MTUyOTM3MDI4NjAwMDAwMDA0XSUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLm1vZHVsZS5zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyLXJvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1naXRodWItY29udHJvbC1zdGF0ZS1tYW5hZ2VyLTIwMjMxMDE2MTUyOTM2OTg3MTAwMDAwMDAzXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtaW5zdGFuY2UtcHJvZmlsZVwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLWluc3RhbmNlLXByb2ZpbGVdJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naGEtYWRtaW5cIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1naGEtYWRtaW5dJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1kZWJpYW4tcmVwb1wiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLWRlYmlhbi1yZXBvXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZ2gtaWRlbnRpdHktcHJvdmlkZXJcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1naC1pZGVudGl0eS1wcm92aWRlcl0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWNsb3VkLWluaXRcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1jbG91ZC1pbml0XSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtc2VydmljZS1uZXR3b3JrXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS1hd3Mtc2VydmljZS1uZXR3b3JrXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtc3RhdGUtYnVja2V0XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS1hd3Mtc3RhdGUtYnVja2V0XSUwQW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTppbmZyYWhvdXNlLXRvb2xraXRdJTBBbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS1jb21cIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6aW5mcmFob3VzZS1jb21dJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNF0lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6YXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XSUwQW1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTpjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xdJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1zdGF0ZS1tYW5hZ2VyXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS1hd3Mtc3RhdGUtbWFuYWdlcl0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXdlYnNpdGUtcG9kXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS1hd3Mtd2Vic2l0ZS1wb2RdJTBBbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYV0lMEFtb2R1bGUucmVwb3NbXCJwcm94eXNxbC1zYW5kYm94XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnByb3h5c3FsLXNhbmRib3hdJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmF3cy1jb250cm9sLTI4OTI1NjEzODYyNF0lMEFtb2R1bGUucmVwb3NbXCJwdXBwZXQtY29kZVwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTpwdXBwZXQtY29kZV0lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTphd3MtY29udHJvbF0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXN0YXRlLW1hbmFnZXJcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXN0YXRlLW1hbmFnZXI6R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1zZXJ2aWNlLW5ldHdvcmtcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXNlcnZpY2UtbmV0d29yazpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXdlYnNpdGUtcG9kXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy13ZWJzaXRlLXBvZDpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0OkFXU19ERUZBVUxUX1JFR0lPTl0lMEFtb2R1bGUucmVwb3NbXCJwdXBwZXQtY29kZVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXB1cHBldC1jb2RlOkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sLTI4OTI1NjEzODYyNDpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXN0YXRlLWJ1Y2tldFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3Mtc3RhdGUtYnVja2V0OkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2w6R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0OkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcInByb3h5c3FsLXNhbmRib3hcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1wcm94eXNxbC1zYW5kYm94OkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZGViaWFuLXJlcG9cIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWRlYmlhbi1yZXBvOkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcInB1cHBldC1jb2RlXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXB1cHBldC1jb2RlOkFXU19ERUZBVUxUX1JFR0lPTl0lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbDpBV1NfREVGQVVMVF9SRUdJT05dJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naGEtYWRtaW5cIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWdoYS1hZG1pbjpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0OkFXU19ERUZBVUxUX1JFR0lPTl0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWNsb3VkLWluaXRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWNsb3VkLWluaXQ6R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3OkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtaW5zdGFuY2UtcHJvZmlsZVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtaW5zdGFuY2UtcHJvZmlsZTpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQ6R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS1jb21cIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWNvbTpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLWNvbVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWNvbTpBV1NfREVGQVVMVF9SRUdJT05dJTBBbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJDT0RBQ1lfUFJPSkVDVF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0OkNPREFDWV9QUk9KRUNUX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZ2gtaWRlbnRpdHktcHJvdmlkZXJcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWdoLWlkZW50aXR5LXByb3ZpZGVyOkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWNvb2tpZWN1dHRlci1naXRodWItY29udHJvbDpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhOkFXU19ERUZBVUxUX1JFR0lPTl0lMEFtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIlBZUElfQVBJX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXQ6UFlQSV9BUElfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNzpBV1NfREVGQVVMVF9SRUdJT05dJTBBbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhOkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQ6QVdTX0RFRkFVTFRfUkVHSU9OXSUwQSUwQVRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb24lMEFwbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6JTBBICArIGNyZWF0ZSUwQSAgfiB1cGRhdGUgaW4tcGxhY2UlMEElMEFUZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczolMEElMEEgICMgbW9kdWxlLnJlcG9zW1widGVzdFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl0gd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiZ2l0aHViX2FjdGlvbnNfc2VjcmV0XCIgXCJzZWNyZXRcIiB7JTBBICAgICAgKyBjcmVhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKSUwQSAgICAgICsgcmVwb3NpdG9yeSAgICAgID0gXCJ0ZXN0XCIlMEEgICAgICArIHNlY3JldF9uYW1lICAgICA9IFwiR0hfVE9LRU5cIiUwQSAgICAgICsgdXBkYXRlZF9hdCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5yZXBvc1tcInRlc3RcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbyB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJnaXRodWJfcmVwb3NpdG9yeVwiIFwicmVwb1wiIHslMEEgICAgICArIGFsbG93X2F1dG9fbWVyZ2UgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgKyBhbGxvd19tZXJnZV9jb21taXQgICAgICAgICAgPSB0cnVlJTBBICAgICAgKyBhbGxvd19yZWJhc2VfbWVyZ2UgICAgICAgICAgPSB0cnVlJTBBICAgICAgKyBhbGxvd19zcXVhc2hfbWVyZ2UgICAgICAgICAgPSB0cnVlJTBBICAgICAgKyBhcmNoaXZlZCAgICAgICAgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgICsgZGVmYXVsdF9icmFuY2ggICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZGVsZXRlX2JyYW5jaF9vbl9tZXJnZSAgICAgID0gZmFsc2UlMEEgICAgICArIGRlc2NyaXB0aW9uICAgICAgICAgICAgICAgICA9IFwiTW9kdWxlIHRoYXQgY3JlYXRlcyBhbiBTMyBidWNrZXQgZm9yIGEgVGVycmFmb3JtIHN0YXRlLlwiJTBBICAgICAgKyBldGFnICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBmdWxsX25hbWUgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBnaXRfY2xvbmVfdXJsICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBoYXNfaXNzdWVzICAgICAgICAgICAgICAgICAgPSB0cnVlJTBBICAgICAgKyBodG1sX3VybCAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBodHRwX2Nsb25lX3VybCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBtZXJnZV9jb21taXRfbWVzc2FnZSAgICAgICAgPSBcIlBSX1RJVExFXCIlMEEgICAgICArIG1lcmdlX2NvbW1pdF90aXRsZSAgICAgICAgICA9IFwiTUVSR0VfTUVTU0FHRVwiJTBBICAgICAgKyBuYW1lICAgICAgICAgICAgICAgICAgICAgICAgPSBcInRlc3RcIiUwQSAgICAgICsgbm9kZV9pZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcHJpbWFyeV9sYW5ndWFnZSAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcHJpdmF0ZSAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcmVwb19pZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc3F1YXNoX21lcmdlX2NvbW1pdF9tZXNzYWdlID0gXCJDT01NSVRfTUVTU0FHRVNcIiUwQSAgICAgICsgc3F1YXNoX21lcmdlX2NvbW1pdF90aXRsZSAgID0gXCJDT01NSVRfT1JfUFJfVElUTEVcIiUwQSAgICAgICsgc3NoX2Nsb25lX3VybCAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc3ZuX3VybCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdG9waWNzICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdmlzaWJpbGl0eSAgICAgICAgICAgICAgICAgID0gXCJwdWJsaWNcIiUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5yZXBvc1tcInRlc3RcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXYgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiZ2l0aHViX3RlYW1fcmVwb3NpdG9yeVwiIFwiZGV2XCIgeyUwQSAgICAgICsgZXRhZyAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwZXJtaXNzaW9uID0gXCJwdXNoXCIlMEEgICAgICArIHJlcG9zaXRvcnkgPSBcInRlc3RcIiUwQSAgICAgICsgdGVhbV9pZCAgICA9IFwiNzMzMjgxNVwiJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4uYXdzX2lhbV9wb2xpY3kuZ2l0aHViIHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZSUwQSAgfiByZXNvdXJjZSBcImF3c19pYW1fcG9saWN5XCIgXCJnaXRodWJcIiB7JTBBICAgICAgICBpZCAgICAgICAgICA9IFwiYXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvaWgtdGYtZ2l0aHViLWNvbnRyb2wtZ2l0aHViMjAyMzEwMTYxNTI5MzQ4NzM4MDAwMDAwMDFcIiUwQSAgICAgICAgbmFtZSAgICAgICAgPSBcImloLXRmLWdpdGh1Yi1jb250cm9sLWdpdGh1YjIwMjMxMDE2MTUyOTM0ODczODAwMDAwMDAxXCIlMEEgICAgICB+IHBvbGljeSAgICAgID0ganNvbmVuY29kZSglMEEgICAgICAgICAgfiB7JTBBICAgICAgICAgICAgICB+IFN0YXRlbWVudCA9IFslMEEgICAgICAgICAgICAgICAgICB+IHslMEEgICAgICAgICAgICAgICAgICAgICAgfiBSZXNvdXJjZSA9IFwiKlwiIC0+IFslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJhcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnJvbGUvaWgtdGYtZ2l0aHViLWNvbnRyb2wtYWRtaW5cIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJhcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnJvbGUvaWgtdGYtdGVycmFmb3JtLWNvbnRyb2xcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJhcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnJvbGUvaWgtdGYtZ2l0aHViLWNvbnRyb2wtc3RhdGUtbWFuYWdlclwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgICAgICAgLSBTaWQgICAgICA9IFwiVmlzdWFsRWRpdG9yMFwiJTBBICAgICAgICAgICAgICAgICAgICAgICAgIyAoMiB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICMgKDEgdW5jaGFuZ2VkIGF0dHJpYnV0ZSBoaWRkZW4pJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgKSUwQSAgICAgICAgdGFncyAgICAgICAgPSB7fSUwQSAgICAgICAgIyAoNSB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pJTBBICAgIH0lMEElMEFQbGFuOiAzIHRvIGFkZCwgMSB0byBjaGFuZ2UsIDAgdG8gZGVzdHJveS4lMEElMEFcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDAlMEElMEFTYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhbiUwQSUwQVRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OiUwQSAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCIlMEFcbjo6ZGVidWc6OnN0ZGVycjogXG46OmRlYnVnOjpleGl0Y29kZTogMFxuIiwgInN0ZGVyciI6ICIiLCAiYWRkIjogMywgImNoYW5nZSI6IDEsICJkZXN0cm95IjogMH19```
</p></details>